Revit 2027 API
ParameterTypeId.StructuralSectionCommonShearAreaWeakAxis Property
 "Shear Area weak axis"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonShearAreaWeakAxis { get; }
Public Shared ReadOnly Property StructuralSectionCommonShearAreaWeakAxis As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonShearAreaWeakAxis {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonShearAreaWeakAxis : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace